## Terraform Plan Results

| Step | Status |
|------|--------|
| 🖌️ Format | ✅ Passed |
| ⚙️ Init | ✅ Passed |
| 📝 Validate | ✅ Passed |
| 📋 Plan | ✅ Passed |

<details>
<summary>Show Plan Output</summary>

```terraform
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=6a8e59c4f3b301ef9096280c6dcfbde3ca87f227]
cloudflare_turnstile_widget.ifs_widget: Refreshing state... [id=0x4AAAAAACC1jetWzl31A2VS]
aws_acm_certificate.subdomain_cert: Refreshing state... [id=arn:aws:acm:us-east-1:533267177082:certificate/4cc8d0f9-09a7-4203-87b8-be277761b20f]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
cloudflare_record.acm_certificate_cname: Refreshing state... [id=cfc0a223b0d041b0e58c7247fe063ddd]
aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E1CER2APENQ1UU]
aws_iam_policy.allow_s3_access: Refreshing state... [id=arn:aws:iam::533267177082:policy/allow_s3_policy]
aws_iam_role.lambda_role: Refreshing state... [id=lambda_role]
aws_s3_bucket.main_bucket: Refreshing state... [id=ifs-storage-bucket]
aws_iam_role_policy_attachment.combined_policy_attachment: Refreshing state... [id=lambda_role-20251125123608469300000002]
aws_lambda_function.upload_function: Refreshing state... [id=upload_function]
aws_lambda_function_url.upload_function_url: Refreshing state... [id=upload_function]
aws_s3_bucket_cors_configuration.allow_ifs_cors: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_public_access_block.allow_public_acl: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_lifecycle_configuration.one_day_lifetime: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_website_configuration.s3_site_config: Refreshing state... [id=ifs-storage-bucket]
aws_s3_object.index_html: Refreshing state... [id=index.html]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2C9XYLKDNE51M]
cloudflare_record.cloudfront_to_ifs_cname: Refreshing state... [id=e18237ce958691807fc42c96469ad21a]
aws_s3_bucket_policy.main_bucket_policy: Refreshing state... [id=ifs-storage-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.allow_s3_access must be replaced
-/+ resource "aws_iam_policy" "allow_s3_access" {
      ~ arn              = "arn:aws:iam::533267177082:policy/allow_s3_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Grant access toS3" -> "Grant access to S3" # forces replacement
      ~ id               = "arn:aws:iam::533267177082:policy/allow_s3_policy" -> (known after apply)
        name             = "allow_s3_policy"
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPAXYKJTLZ5NX7BUIW7G" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.combined_policy_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "combined_policy_attachment" {
      ~ id         = "lambda_role-20251125123608469300000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::533267177082:policy/allow_s3_policy" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>